tutorials/multiphase/interFoam/micromodel/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet 
    {
        type            flowRateInletVelocity;
        flowRate        flowrate;//3.41e-8;
        value uniform (0 0 0);
    }
    
    outlet 
    {
        type            zeroGradient;
    }

    walls 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    solidwalls 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
