tutorials/multiphase/interFoam/micromodel/0_org/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outlet 
    {
        type            zeroGradient;
    }

    solidwalls
    {
        type            constantAlphaContactAngle;
	limit		zeroGradient;
	theta0		contactAngle;
	value		uniform 0;
    }

    walls 
    {
        type            constantAlphaContactAngle;
        limit           zeroGradient;
        theta0          45;
        value           uniform 0;
    }


    frontandback
    {
        type            empty;
    }

}

// ************************************************************************* //
